#include <stdio.h>
#include <locale.h>
#define SIZE 9

void meny()
{
    printf("\nМеню\n");
    printf("1)Играть в игру головолмку Змея\n2)Правила игры\n3)Выйти из игры\n");
    printf("Введите цифру согласно значениям в меню, чтобы выбрать действие:");
}

char pole(char A[SIZE][SIZE], char stroka[], char stolb[])
{
    printf("Головоломка Snake\n");
    printf(" _________________\n");
    for (int i = 0; i < SIZE; i++)
    {
        printf("|");
        for (int j = 0; j < SIZE; j++)
        {
            if (A[i][j] == '4')
            {
                printf("%c|", 4);
            }
            else
            {
                printf("_|");
            }

        }
        printf("%c", stroka[i]);
        printf("\n");
    }
    for (int i = 0; i < SIZE; i++)
    {
        printf(" %c", stolb[i]);
    }
}

void main()
{
    setlocale(LC_ALL, "RUS");
    int d, q = 0;
    while (q < 1)
    {
        meny();
        scanf("%d", &d);

        char A[SIZE][SIZE] =
        {
        {'4','0','0','0','0','0','0','0','0'},
        {'0','0','0','0','0','0','0','0','0'},
        {'0','0','0','0','0','0','0','0','0'},
        {'0','0','0','0','0','0','0','0','0'},
        {'0','0','0','0','0','0','0','0','0'},
        {'0','0','0','0','0','0','0','0','0'},
        {'0','0','0','0','0','0','0','0','0'},
        {'0','0','0','0','0','0','0','0','0'},
        {'0','0','0','0','0','0','0','0','4'},
        };

        char stroka[9] = { '1', '6', '1', '4', '3', '4', '3', '4', '7' };
        char stolb[9] = { '6', '4', '4', '3', '3', '7', '1', '4', '1' };

        char B[SIZE][SIZE] =
        {
        {'4','0','0','0','0','0','0','0','0'},
        {'4','4','4','4','4','4','0','0','0'},
        {'0','0','0','0','0','4','0','0','0'},
        {'0','0','4','4','4','4','0','0','0'},
        {'4','4','4','0','0','0','0','0','0'},
        {'4','0','0','0','0','4','4','4','0'},
        {'4','0','0','0','0','4','0','4','0'},
        {'4','4','0','0','0','4','0','4','0'},
        {'0','4','4','4','4','4','0','4','4'},
        };

        char D[SIZE][SIZE] =
        {
        {'4','0','0','0','0','0','0','0','0'},
        {'0','0','0','0','0','0','0','0','0'},
        {'0','0','0','0','0','0','0','0','0'},
        {'0','0','0','0','0','0','0','0','0'},
        {'0','0','0','0','0','0','0','0','0'},
        {'0','0','0','0','0','0','0','0','0'},
        {'0','0','0','0','0','0','0','0','0'},
        {'0','0','0','0','0','0','0','0','0'},
        {'0','0','0','0','0','0','0','0','4'},
        };

        switch (d)
        {
        case (1):
            pole(A, stroka, stolb);

            int k = 0, n = 0;
            for (int c = 0; c < 1000; c++)
            {
                printf("\nВведите координаты клетки\n");
                int x, y;
                scanf("%d %d", &x, &y);
                D[x][y] = '4';
                if (D[x][y] != A[x][y] && D[x][y] == B[x][y])
                {
                    A[x][y] = '4';

                    pole(A, stroka, stolb);

                    k = k + 1;
                    if (k == 31)
                    {
                        printf("\nПОЗДРАВЛЯЕМ!!!\nВЫ решили головоломку.\n");
                        break;
                    }
                }
                else if (A[x][y] == D[x][y])
                {
                    printf("Координаты введены повторно, попробуйте ещё раз");
                }
                else
                {
                    printf("Введены неверные координаты\n");
                    n = n + 1;
                    printf("Количество ошибок %d из 6\n", n);
                    if (n == 6)
                    {
                        printf("Проиграли.\nПопробуйте ещё раз\n");
                        break;
                    }
                }
            }
            break;
        case 2:
        {
            printf("\nПравила\nЗмея («Snake») - разновидность логической головоломки.\nЗадание представляет собой прямоугольную или квадратную сетку, внутри которой указаны начальная и конечная точки «змеи».\nНеобходимо закрасить черным цветом некоторые клетки таким образом, чтобы они образовали непрерывную линию между точками.\n«Змея» не может касаться сама себя, даже по диагонали.\nЧисла по бокам сетки показывают, сколько черных клеток находится в соответствующем ряду и столбце сетки.\n");
            break;
        }
        case 3:
        {
            return 1;
        }
        default:
        {
            printf("\nТакого значения нет в меню\n");
        }
        }
    }
}